src/test/resources/mockdata/encumbrances/two_pending_encumbrances.json

{
  "transactions": [
    {
      "id": "1e42ac94-8fba-4245-aa99-35af60108588",
      "amount": 0,
      "source": "PoLine",
      "currency": "USD",
      "metadata": {
        "createdDate": "2020-05-29T05:39:34.175",
        "updatedDate": "2020-05-29T05:39:34.175+0000",
        "createdByUserId": "00000001-1111-5555-9999-999999999999",
        "updatedByUserId": "00000001-1111-5555-9999-999999999999"
      },
      "fromFundId": "7fbd5d84-62d1-44c6-9c45-6cb173998bbd",
      "encumbrance": {
        "status": "Pending",
        "orderType": "One-Time",
        "reEncumber": false,
        "subscription": false,
        "amountExpended": 0,
        "sourcePoLineId": "d5c468b0-89cc-4fa2-b75e-38a9a7f18df7",
        "amountAwaitingPayment": 0,
        "sourcePurchaseOrderId": "d0dbafca-d05d-4d3f-8d83-e9722eb179d3",
        "initialAmountEncumbered": 0
      },
      "fiscalYearId": "ac2164c7-ba3d-1bc2-a12c-e35ceccbfaf2",
      "transactionType": "Encumbrance"
    },
    {
      "id": "1e42ac94-8fba-4245-aa99-35af60108588",
      "amount": 0,
      "source": "PoLine",
      "currency": "USD",
      "metadata": {
        "createdDate": "2020-05-29T05:39:34.175",
        "updatedDate": "2020-05-29T05:39:34.175+0000",
        "createdByUserId": "00000001-1111-5555-9999-999999999999",
        "updatedByUserId": "00000001-1111-5555-9999-999999999999"
      },
      "fromFundId": "68872d8a-bf16-420b-829f-206da38f6c10",
      "encumbrance": {
        "status": "Pending",
        "orderType": "One-Time",
        "reEncumber": false,
        "subscription": false,
        "amountExpended": 0,
        "sourcePoLineId": "d5c468b0-89cc-4fa2-b75e-38a9a7f18df7",
        "amountAwaitingPayment": 0,
        "sourcePurchaseOrderId": "d0dbafca-d05d-4d3f-8d83-e9722eb179d3",
        "initialAmountEncumbered": 0
      },
      "fiscalYearId": "ac2164c7-ba3d-1bc2-a12c-e35ceccbfaf2",
      "transactionType": "Encumbrance"
    }
  ],
  "totalRecords": 1
}
